src/Documents/ЗакрытиеДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗакрытиеДня</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусныеСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРабочегоДня</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗакрытиеБонусныхСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Карты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закрыт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписаниеНачисленийБонусныхСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БонусныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНачисления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
								<v8:Type>cfg:DocumentRef.Прием</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияПоБонусномуСчету</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СтатусыРабочегоДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыРабочегоДня</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
					<Comment>Определяет состояние рабочего дня</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
					<Comment>Определяет состояние рабочего дня</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗакрытиеДня/Ext/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства, Знач ЗакрытиеОтрицательныхОстатков = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОНЕЦПЕРИОДА(СписаниеНачисленийБонусныхСчетов.Ссылка.Дата, ДЕНЬ) КАК Период,
	|	СписаниеНачисленийБонусныхСчетов.БонусныйСчет КАК БонусныйСчет,
	|	СписаниеНачисленийБонусныхСчетов.ДокументНачисления КАК ДокументНачисления,
	|	СУММА(СписаниеНачисленийБонусныхСчетов.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаСписаниеНачисленийБонусныхСчетов
	|ИЗ
	|	Документ.ЗакрытиеДня.СписаниеНачисленийБонусныхСчетов КАК СписаниеНачисленийБонусныхСчетов
	|ГДЕ
	|	СписаниеНачисленийБонусныхСчетов.Ссылка = &Ссылка
	|	И СписаниеНачисленийБонусныхСчетов.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРабочегоДня.Закрыт)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеНачисленийБонусныхСчетов.Ссылка,
	|	СписаниеНачисленийБонусныхСчетов.БонусныйСчет,
	|	СписаниеНачисленийБонусныхСчетов.ДокументНачисления,
	|	КОНЕЦПЕРИОДА(СписаниеНачисленийБонусныхСчетов.Ссылка.Дата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	   	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаБонусныеСчета(ДокументСсылка, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаБонусныеСчета(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВременнаяТаблицаСписаниеНачисленийБонусныхСчетов.Период КАК Период,
	|	ВременнаяТаблицаСписаниеНачисленийБонусныхСчетов.БонусныйСчет КАК БонусныйСчет,
	|	ВременнаяТаблицаСписаниеНачисленийБонусныхСчетов.ДокументНачисления КАК ДокументНачисления,
	|	ВременнаяТаблицаСписаниеНачисленийБонусныхСчетов.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаСписаниеНачисленийБонусныхСчетов КАК ВременнаяТаблицаСписаниеНачисленийБонусныхСчетов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаБонусныеСчета", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры  // СформироватьТаблицаБонусныеСчета()

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура обновляет рабочий день текущей СЕ и рабочие дни остальных СЕ, для которых это необходимо.
// Условие необходимости наличие записей в регистрах по абонементам.
Процедура ОбновлениеЗакрытияДней() Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
		
	МассивСтруктурныхЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц();
	
	Для Каждого СтруктурнаяЕдиница Из МассивСтруктурныхЕдиниц Цикл
		
		// ЧасовойПоясТекущегоСеанса	= ЧасовойПоясСеанса();
		// ЧасовойПоясСЕ				= СтруктурнаяЕдиница.ЧасовойПояс;
		//
		// Если ЧасовойПоясТекущегоСеанса <> ЧасовойПоясСЕ Тогда   			
		//	УстановитьЧасовойПоясСеанса(ЧасовойПоясСЕ);         			
		// КонецЕсли;  
		
		Запрос =  Новый Запрос;
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
		Запрос.УстановитьПараметр("Период"				, ТекущаяДатаСеанса());
		Запрос.Текст  = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗакрытиеДня.Ссылка КАК Ссылка,
		|	ЗакрытиеДня.Дата КАК Дата
		|ИЗ
		|	Документ.ЗакрытиеДня КАК ЗакрытиеДня
		|ГДЕ
		|	ЗакрытиеДня.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ЗакрытиеДня.ПометкаУдаления = ЛОЖЬ
		|	И ЗакрытиеДня.Дата <= &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗакрытиеДня.Дата УБЫВ";
		
		Результат = Запрос.Выполнить().Выбрать();
		
		// Если есть предыдущий Рабочий День - закрываем
		Если Результат.Следующий() Тогда
			
			// Если есть документ на текущий день, то ничего не делаем
			Если НачалоДня(Результат.Дата) = НачалоДня(ТекущаяДатаСеанса()) Тогда
				Продолжить;
			КонецЕсли; 
			
			// Закрываем предыдущий день
			ЗакрытиеДняОбъект          = Результат.Ссылка.ПолучитьОбъект();
			ЗакрытиеДняОбъект.Дата	   = КонецДня(ЗакрытиеДняОбъект.Дата);
			ЗакрытиеДняОбъект.Статус   = Перечисления.СтатусыРабочегоДня.Закрыт;
			ЗакрытиеДняОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
			ЗакрытиеДняОбъект.Записать(РежимЗаписиДокумента.Проведение);				
			
			// Создаем дни на каждый день с последнего, что бы не было пропусков, хотя это на остатки не влияет, только на бухию
			Для а = 1 По Окр((ТекущаяДатаСеанса() - Результат.Дата) / (24*60*60) - 1) Цикл
				ЗакрытиеДняОбъект                    = Документы.ЗакрытиеДня.СоздатьДокумент();
				ЗакрытиеДняОбъект.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
				ЗакрытиеДняОбъект.Дата               = КонецДня(Результат.Дата + а*24*60*60);
				ЗакрытиеДняОбъект.Статус             = Перечисления.СтатусыРабочегоДня.Закрыт;
				ЗакрытиеДняОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
				ЗакрытиеДняОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЦикла;
			
		Иначе
			
			// Создаем и закрываем предыдущий день, что бы остатки выравнялись
			ЗакрытиеДняОбъект                    = Документы.ЗакрытиеДня.СоздатьДокумент();
			ЗакрытиеДняОбъект.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
			ЗакрытиеДняОбъект.Дата               = КонецДня(ТекущаяДатаСеанса() - 24*60*60);
			ЗакрытиеДняОбъект.Статус             = Перечисления.СтатусыРабочегоДня.Закрыт;
			ЗакрытиеДняОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
			ЗакрытиеДняОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;		
		
		// Открываем существующий день
		ЗакрытиеДняОбъект                    = Документы.ЗакрытиеДня.СоздатьДокумент();
		ЗакрытиеДняОбъект.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		ЗакрытиеДняОбъект.Дата               = ТекущаяДатаСеанса();
		ЗакрытиеДняОбъект.Статус             = Перечисления.СтатусыРабочегоДня.Открыт;
		ЗакрытиеДняОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		ЗакрытиеДняОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла; 
		
КонецПроцедуры

// Функция вернет текущий рабочий день при условии что он открыт
Функция ПолучитьДокументЗакрытияДня(СтруктурнаяЕдиница = Неопределено, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(СтруктурнаяЕдиница <> Неопределено, СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	Запрос.УстановитьПараметр("Дата", 				?(Дата <> Неопределено, НачалоДня(Дата), НачалоДня(ТекущаяДата())));
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	ЗакрытиеДня.Ссылка КАК Ссылка,
	               |	ЗакрытиеДня.Статус КАК Статус
	               |ИЗ
	               |	Документ.ЗакрытиеДня КАК ЗакрытиеДня
	               |ГДЕ
	               |	ЗакрытиеДня.Проведен = ИСТИНА
	               |	И ЗакрытиеДня.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |	И ЗакрытиеДня.Дата >= &Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗакрытиеДня.Дата";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Функция - Получить документы закрытия дня за период
//
// Параметры:
//  НачалоПериода		 - 	 - 
//  КонецПериода		 - 	 - 
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьДокументыЗакрытияДняЗаПериод(НачалоПериода, КонецПериода, СтруктурнаяЕдиница = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(СтруктурнаяЕдиница <> Неопределено, СтруктурнаяЕдиница, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница));
	Запрос.УстановитьПараметр("НачалоПериода"     ,	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"      ,	КонецПериода);
	
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗакрытиеДня.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеДня КАК ЗакрытиеДня
	|ГДЕ
	|	ЗакрытиеДня.Проведен = ИСТИНА
	|	И ЗакрытиеДня.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ЗакрытиеДня.Дата >= &НачалоПериода
	|	И ЗакрытиеДня.Дата <= &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗакрытиеДня.Дата";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

#КонецЕсли
